#+STARTUP: overview

*** Dashboard

#+BEGIN_SRC emacs-lisp :results none

(use-package dashboard
  :straight t
  :config
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))
        dashboard-items '((projects . 5)
                  (recents . 5))
dashboard-banners-directory (concat purplg/config-dir "banners/")
dashboard-startup-banner (+ 1 (random 3)))

  (dashboard-setup-startup-hook)

  (add-hook 'dashboard-after-initialize-hook (lambda () 
    (with-current-buffer "*dashboard*" (emacs-lock-mode 'kill)))))

#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
(setq dashboard-set-navigator t)
(setq dashboard-navigator-buttons
      `(((nil "Home Assistant" "Home Assistant" (lambda (&rest _) (hass/query-entities))))))
#+END_SRC

#+RESULTS:
| (nil Home Assistant Home Assistant (lambda (&rest _) (hass/query-entities))) |

